{"scene0046_00": {"situation_0": ["I am entering the room.", ["What color is the wardrobe in front of me?", "How many backpacks in front of me?", "Can I see shower curtains in my direction?", "Which direction is the door?", "Which direction is the bathtub?"]], "situation_1": ["I am washing my face at the sink with a bathtub on my right.", ["Is the toilet seat covered up or down to my left?", "What color is the blanket on the bed to my left side, next room?", "Is the toilet seat to my left up or down?", "Are the curtains to my right closed or open?", "What is the toothbrush in front of me resting on?"]], "situation_2": ["I am standing by the desk facing the wardrobe and a suitcase.", ["What color is the seat to my right?", "What color is the blanket on the bed in front of me?", "Is the wardrobe in front of me closed or open?", "Are the curtains to my left closed or open?", "Are the curtains short or long to my left?"]], "situation_3": ["I am using the toilet.", ["What is the first object you run into in front of me?", "What object is directly behind me?", "What object is under me on the floor that is not the toilet?", "What is the blue object to the left of me not on the floor?", "How many shower curtains are to my left?"]], "situation_4": ["I am standing by the toilet facing the bathtub.", ["Do the mat and the towel on my left have different colors?", "Is the bathroom well illuminated?", "Which way should I go if I want to see myself in the mirror?", "Which is closer to me, the sink or the bathtub?", "I am tired and want to have a seat, which way should I turn?"]], "situation_5": ["I am standing picking up my pillow with a backpack in my six o'clock direction.", ["Are the curtains on my 8 o'clock direction open or closed?", "I am inside the bathroom; true or false?", "Is the TV on my 10 o'clock direction on of off?", "From my current position, can I be able to pack the clothes inside the backpack without moving or changing the direction?", "Is the screen of the laptop on my 8 o'clock direction on or off?"]], "situation_6": ["I am lying on the bed with a table in my nine o'clock direction and facing the wardrobe.", ["Is the TV on or off in front of me to the right?", "What color are the curtains in front of me?", "Are the wardrobe doors open or closed in front of me?", "Are the curtains letting light in, yes or no in front of me?", "If I wanted to let the breeze in, what should I open in front of me?"]], "situation_7": ["I am packing my suitcase with the wardrobe behind me.", ["Is it possible to reach the table in my two o'clock direction from my position?", "What color is the desk in my one o'clock direction?", "How many pillows are on the bed to my left?", "Can I see a laptop in front of me?", "Which way should I go to exit the room?"]], "situation_8": ["I am sitting on the chair working on the laptop.", ["If I turn my head, what could I see above the bed behind me?", "Which object on my right side will I need to travel?", "Is the color of the table in my 10 o'clock direction similar to grass?", "If I need to go outside, which way to go?", "Where behind me my new shirt?"]], "situation_9": ["I am picking up my backpack with a table in front of me.", ["Is the chair in front of me by the desk hard or cushioned?", "Does the window in front of me have a curtain covering it?", "Is the TV to my 2 o'clock on or off?", "Is the desk in front of me clear or messy?", "Will I need to open the door if I am going to use the bathroom?"]]}, "scene0024_00": {"situation_0": ["I am looking out the window while standing between two tables and the radiator is within reach.", ["Is the amount of plants that are on the right side of the room odd or even?", "What is on top of the couch that is on my right?", "What is above the couch that is on my right?", "How many chairs are under the table behind me?", "Is the amount of windows in the room odd or even?"]], "situation_1": ["I am sitting on the leftmost side of a couch in front of a ball, while there are two lamps on my left.", ["Is it possible to play the piano in front of e without moving?", "Which is bigger between the piano bench ahead of me and the cabinet in my 2 o'clock direction?", "What is closer to me between the lamp in my 9 o'clock direction and the piano stool in front of me?", "Which way should I go if I want to go upstairs?", "Is the lamp in my 9 o'clock direction and the piano stool in front of me the same color?"]], "situation_2": ["I am sitting on a piano bench facing the couch with the armchair in my one o'clock direction.", ["How many chairs are at the table to my left?", "What is behind the armchair?", "If I sat in the armchair , what large piece of furniture would I be facing?", "What is hanging above the couch?", "What color is the armchair and the couch?"]], "situation_3": ["I am crouched in front of the box keeping some documents and in front of me is the door.", ["Am I closer to the piano or couch?", "Is the ball to my right?", "Can I see the outside from the door?", "Is there a backpack to my left?"]], "situation_4": ["I am fixing a radiator facing a window on top of it.", ["Is the blind in front of me closed or open partially?", "Is the table behind me square shape or round shape?", "What instrument to my right behind me is played using fingers?", "What color is the brightest pillow on the couch to my right?", "What object needs to be watered to my right?"]], "situation_5": ["I am packing my bag that is on the table with a chair on my right.", ["Can the amount of couches behind me be divided by three?", "What integer can the amount of lamps on my right be divided by?", "Which direction should I go if I want to sit on the armchair?", "Is the amount of cabinets I am facing odd or even?", "Can I see the ball at where I am standing?"]], "situation_6": ["I am leaning on the radiator facing a table with six chairs.", ["How many lamps in my 8 o'clock direction?", "Is the color of the sofa behind me red or black?", "Can I see the piano where I am standing?", "Which direction should I go if I want to exit the room?", "Can I see pictures at where I am standing?"]], "situation_7": ["I am opening a door.", ["Is there a backpack to my left?", "Is there a couch to my left?", "How many chairs are behind me?", "Is the painting to my left abstract or non-abstract?"]], "situation_8": ["I am playing with the ball and on my left is the couch within reach.", ["How many seat cushions does the couch to my left have?", "What color is the pillow on the couch the same color a banana on my left?", "What is in front of me that needs water from time to time?", "Am I in the bathroom?", "What side is the couch on from where I am standing?"]], "situation_9": ["I play the piano.", ["What is to the left that needs water?", "What is allowing natural light come in room to my left?", "What is on the floor to my right that is black?", "What are the blue slippers resting in front of me?", "What color is the cover for the piano in front?"]]}, "scene0017_00": {"situation_0": ["I am sitting on a chair under the whiteboard and facing the desk with another chair on my left.", ["Is the amount of file cabinets on my left odd or even?", "What integer can the amount of monitors in front of me be divided by?", "Which direction should I go if I want to exit the room?", "Can the amount of trash can behind me be divided by three?", "Can I see monitors at where I am standing?"]], "situation_1": ["I am sitting on the chair relaxing a little and next to my right side there is a chair and a whiteboard.", ["How many chairs are in the room?", "What is behind the chair that is on my right?", "How many monitors are on top of the desk that is on my left?", "What is under the desk that is in front of me?", "What is right next to the chair that is on my right?"]], "situation_2": ["I am standing in between a chair and the door and facing two trash cans.", ["Am I in the kitchen?", "What is in front of me that is rectangle shape and you can write on?", "What is installed to cover the windows to my right?", "What is coming through the blinds on my right?", "What is the largest furniture to my right?"]], "situation_3": ["I am opening the window with a desk on my left.", ["What object is directly behind me?", "What is the first object on my left on top of the desk?", "What color is the chair behind me?", "What is on the left wall at eight o'clock?", "How many chairs are directly behind me?"]], "situation_4": ["I am throwing trash into a trash can while the whiteboard is on my right within reach.", ["Which direction should I go if I want to sit down?", "Can I see the file cabinet where I am standing?", "Which direction should I go if I want to exit the room?", "Which direction should I go if I want to water the plant?", "Can the number of monitors behind me be divided by two?"]], "situation_5": ["I am cleaning the window with the desk on my right.", ["How many chairs are there?", "What color is the desk?", "What color is the book?", "What is the location of the door?", "What color are the chairs?"]], "situation_6": ["I am sitting on a chair facing the whiteboard with a door in my nine o'clock direction.", ["What is in front of me that has writing on the wall?", "What is the large furniture to my right that is flat?", "How many monitors are on my right total?", "What is flat to my right and standing up right on desk?"]], "situation_7": ["I am pushing the door.", ["Which direction should I go if I want to sit on the desk?", "Is the amount of file cabinet behind me odd or even?", "Can I see keyboards where I am standing?", "What integer can the amount of trash cans on my right be divided by?", "Can the number of monitors behind me be divided by three?"]], "situation_8": ["I am throwing trash into the trash can with another trash can on my right and the door is right behind me.", ["How many monitors are on the right?", "How many windows are on the right?", "How many chairs are behind?", "How many chairs are on the right?", "How many tables are on the right?"]], "situation_9": ["I am cleaning the whiteboard and there are two trash cans on the left.", ["Is the desk behind me messy or tidy?", "Is the door on my 7 o'clock direction open or closed?", "Is the number of chairs towards right even or odd?", "From my current position, can I be able to water the plant without moving?", "Does the shape of the whiteboard resemble that of a rectangle?"]]}, "scene0047_00": {"situation_0": ["I am opening a door with a trash can on my right.", ["What is right next to the trash can that is on my right?", "Is the amount of cabinets odd or even?", "How many windows are in the room?", "How many chairs are next to the dining table that is on my 7 o'clock?", "What is on top of the cabinets behind me?"]], "situation_1": ["I am doing my dishes at the sink.", ["What is the first object I'd run into directly behind me?", "How many trash cans are on my left?", "What color is the refrigerator to my right?", "What object is at my eleven o'clock?", "How many chairs are behind me?"]], "situation_2": ["I am sitting on the chair facing the kitchen counter while there is a chair on my left.", ["What is the first object I'd run into directly behind me?", "What object is to my immediate left?", "What object is directly in front of me?", "How many doors are to my right?", "How many microwaves are in front of me?"]], "situation_3": ["I am standing by the microwave on my left with a refrigerator in my three o'clock direction.", ["Which one is closer to the table on my right, a sink or a door?", "Which is further away from me, a chair or a trash can?", "Which one is closer to me, a soap dispenser or a paper towel dispenser?", "Can I go further forward?"]], "situation_4": ["I am sitting on a chair facing a chair with another chair on my right.", ["How many trash cans are to my right?", "What object is directly in front of me?", "What color is the dining table in front of me?", "What is the first object I'd run into behind me?", "What is the highest object directly behind me?"]], "situation_5": ["I am pushing a door and there is a trash can by my left foot.", ["Is the table behind me large or small?", "What is the white appliance behind me to the left?", "What can I use to heat up my food on the left side of the room on the counter behind me?", "Are the tables edges behind me rounded or straight?", "How many windows are to my right side?"]], "situation_6": ["I am serving dishes to the dining table with the refrigerator in my one o'clock direction and a door opening behind me.", ["What is above the cabinet on my left?", "Is the amount of cabinets in the room odd or even?", "How many doors are in the room?", "What is on the right of the trash can that is on my 5 o'clock?", "How many chairs does the dining table in front of me have?"]], "situation_7": ["I am washing my hands on the kitchen counter.", ["How many doors are on my right?", "How many cabinets are on the left of the refrigerator?", "What is above the soap dispenser in front of me?", "Which direction should I take to throw something into the trash can?", "How many chairs are under the table behind me?"]], "situation_8": ["I am serving dishes to the dining table with the refrigerator in my nine o'clock direction.", ["Is there odd or even amount of chairs in front of me?", "If I wanted to use the trash, do I walk forward or backward?", "What can I do to heat my food quickly on the left that is above the counter?", "What appliance keeps food from spoiling and cold to my left?"]], "situation_9": ["I am throwing trash while there is a door on my left.", ["Is the table behind me have rounded edges or sharp edges?", "What appliance is to my left that is white behind me?", "What color is the table behind me?", "Am in the bathroom?", "Is the table behind me large or small?"]]}, "scene0000_00": {"situation_0": ["I am sitting on a couch facing the coffee table while there is a bicycle and a curtain on my left.", ["The bathroom is on which side of me?", "Which direction is the refrigerator?", "Is the TV on my left or right?", "What is the large object behind me?"]], "situation_1": ["I am lying on my bed and there is a couch in front of me.", ["Are the curtains to my left covering the entire window?", "What material are the stools made of by the table to my top right side, front?", "Is the TV on or off in front of me to left by cabinet?", "What letter resembles the couch in front of me?", "What object is in front of me that he is two wheels to the left side?"]], "situation_2": ["I am sitting on the couch facing the coffee table and the TV. There is a guitar case to my immediate right.", ["What object has two wheels in front of me?", "What color is the blanket on the bed to my left?", "Is the TV in front of me on or off?", "What object is closed that is in front of me behind the bike?", "How many stools are behind me that are under the table?"]], "situation_3": ["I am opening a door.", ["How many beds are behind to the right?", "How many doors are on the right?", "How many kitchen counters are on the left?", "How many kitchen cabinets are on the left?", "How many couches are behind?"]], "situation_4": ["I am lifting up the bicycle while there is a cabinet on my right and a couch behind me.", ["What is in front of me that moves on two wheels?", "What color is the bed behind me to the left side of the room?", "What letter resembles the couch behind me?", "Is the TV on to my right side?", "The TV to my right is recess into what furniture?"]], "situation_5": ["I am pulling a table that has a curtain behind it while there is a desk on my left.", ["What is the closest thing behind me?", "What is the corner in front of me to the left?", "Is the bathroom behind me?", "Which direction do I need to look to see the TV?", "What color is the large object behind me?"]], "situation_6": ["I am closing a microwave.", ["Is there a toaster to my left?", "What shape is the couch behind me?", "Which direction should I go to leave the room?"]], "situation_7": ["I am closing a refrigerator.", ["How many stools are under the table behind me?", "What is on top of the refrigerator in front of me?", "What is below the kitchen counter on my left?", "What is under the microwave that is on my left?", "What is behind the table that is behind me?"]], "situation_8": ["I am opening the refrigerator and there is a table behind me.", ["Is the toilet cover in bathroom to my right closed or open?", "What color is the blanket on the bed, behind me to the right?", "Is the door to my right open or closed?", "What is the object in front of me counter I can use to toast my bread?", "What letter resembles the couch behind me?"]], "situation_9": ["I am opening the curtain and there is a bicycle on my right.", ["What is on top of the bed that is on my 7 o'clock?", "How many cabinets are in the room?", "What is on the left of the couch that is behind me?", "What is inside the cabinet that is on my right?", "What is behind the bicycle that is on my right?"]]}, "scene0034_00": {"situation_0": ["I am washing my hands at the sink with another sink on my left.", ["How many towels are behind me?", "What shape is the sink to my left?", "Is there a toilet to my left?", "Is there a window behind me?", "What direction should I go to exit the room?"]], "situation_1": ["I am standing by the toilet on my left facing the bathtub.", ["I want to wash my hands after using the toilet. Which way should I go?", "Is there a picture hanging above the bathtub on the wall in front of me?", "What is closer to me between the bathtub and the bathroom vanity to my left?", "I need to take a shower. Which way should I go?", "In which direction should I go if I want to exit the room?"]], "situation_2": ["I am standing by the toilet with a door on my left.", ["Which way do I need to turn to use the toilet?", "How many windows would I see if I turn my head around?", "Is the toilet and door on either side of me made of the same material?", "Is the door to my left open or closed?"]], "situation_3": ["I am washing my face with a door in my six o'clock direction.", ["Can I see the shelf if I turn around?", "Which direction should I go if I want to weight myself?", "Is the amount of towels behind me odd or even?", "Can I see the cup at where I am standing?", "Which direction should I go if I want to exit the room?"]], "situation_4": ["I am sitting in the bathtub and facing the window.", ["What shape is the bathtub behind me?", "How many sinks does the bathroom vanity have?", "Is the door in front of me locked or open?", "What side is the sink so I can wash my hands?", "Is the bathtub behind me black, pink or white in color?"]], "situation_5": ["I am sitting on the ground resting my back against the bathroom vanity and facing towels on the door.", ["Are the window blinds to my right fully closed or partially closed?", "How many sinks are behind me?", "Is the toilet seat covered up or down in the next room to my right?", "What is blue that is on the rack in front of me?", "What can I use to take a bath on my left side?"]], "situation_6": ["I am sitting on the toilet and there is a window to the right.", ["What direction do I need to go if I wanted to use the bathtub?", "What direction do I need to go if I wanted to use the shower?", "What can I use to dry myself after using the shower that is in front of me outside the bathroom to the left?", "What is installed on the window to my right that can come up and down?", "Is the bathroom stall door in front me fully closed or partially open?"]], "situation_7": ["I am taking the towel from the door.", ["What shape is the tub part of the bathtub behind to the left?", "How many sinks are located behind me?", "What direction should I walk if I wanted to use the sinks?", "What are the two colors of the towels in front of me?", "If I wanted to wash my hands, what can I use behind me to do so?"]], "situation_8": ["I am taking a shower facing the towels on the wall.", ["What number would I stop at when counting the number of sinks in the room?", "Which direction would I go if I wanted to weigh myself?", "What is on the floor beside the towels hanging on the rack?", "Are there towels hanging anywhere besides the racks?", "Which way should I go to get the garbage can to empty?"]], "situation_9": ["I am fixing the scale next to the shelf to my left.", ["Is the door to the bathroom in front of me open or closed?", "What shape is the bathtub bowl behind me to my left side?", "What can I use to dry my wet body on the rack in front of me?", "What is preventing the sun from coming through the window on my left side?", "How many oval shape sinks does the bathroom vanity have?"]]}, "scene0054_00": {"situation_0": ["I am sitting on the toilet, doing my business. I can see some boxes in front of me.", ["How many windows are located on the room to my left side?", "What can I stand on to soften the floor to my right hat's in front of the sink?", "What direction should I go if I wanted to leave the room?", "Which room is darker, the room to my left or the room to my right?", "What did I forgot close in front of me for privacy?"]], "situation_1": ["I am shaving at the sink.", ["How many windows on my left?", "Which direction should I go if I want to exit the room?", "Which direction should I go if I want to sit on the couch?", "Can the number of closet doors behind me be divided by three?", "Am I in the bathroom?"]], "situation_2": ["I am facing a bathtub, while there is a toilet on my left.", ["How many couches are in front?", "How many closet doors are to the right?", "How many bath walls are in front?", "How many backpacks a are in front?", "How many red stools are in front?"]], "situation_3": ["I am opening the closet door with another closet door on my right.", ["What is flat and largest furniture to my left?", "What direction can I go to find something to help me climb to change a lightbulb?", "Which room is darker the one on the left or right?", "What is on the left side of the door to my left?", "If I go to the room all the way to my right what can I find that I can use to bring a baby home?"]], "situation_4": ["I am picking up my bag on the ground with the dolly to my right.", ["Is the amount of carseat on my right odd or even?", "Can I see the bathtub at where I am standing?", "What integer can the amount of box behind me be divided by?", "Can I see the bookshelf where I am standing?"]], "situation_5": ["I am printing files.", ["Which direction should I go if I want to exit the room?", "Is the shape of the window I am facing round or rectangular?", "Which direction should I go if I want to use the drawer?", "Can the number of closet doors on my right be divided by three?", "Which direction should I go if I want to sit down?"]], "situation_6": ["I am standing on a mug facing a door while there is a sink behind me.", ["How many monitors are on the desk in the room to my left?", "Which room is darket, one to my left or one to my right?", "What shape is the sink behind me?", "Is the toilet seat cover down or up behind me?", "Are all the blinds closed on the room to my right?"]], "situation_7": ["I am getting a book from the bookshelf, while having a ball on my right.", ["How many doors are on the right?", "How many desks are behind me on the left?", "How many shelfs are in front of me?", "How many stools are on the right?", "How many pillows are behind me on a couch on the right?"]], "situation_8": ["I am sitting on the carseat facing a door.", ["What is to my right that allows light to come into room?", "What is covering the windows in front of me?", "Am I in the playground?", "Which room is brighter where I am or to my left?", "What is to my left used to climb higher?"]], "situation_9": ["I am sitting on the chair at my desk watching videos on my monitor.", ["If I wanted to get a dictionary on bookshelf , what direction should I go?", "Are the blinds on the windows to my right side up or down?", "What's hung on the door to my left side?", "Is the toilet in the bathroom behind me seat covered up or down?", "How many seat cushions on the left side of me?"]]}, "scene0065_00": {"situation_0": ["I am sitting in the bathtub with the toilet on my left.", ["Is the tub behind me square or rectangle?", "What is in front of me that will get my hands clean?", "What will fall off the back of the door in front of me if I slam it?", "What direction do I need to go to get out of this room?"]], "situation_1": ["I am fixing the bathroom cabinet with the door behind me.", ["How many cabinets are in front?", "How many bathtubs are on the left?", "How many plungers are on the left?", "How many mirrors are in front?", "How many toilets are left?"]], "situation_2": ["I am standing inside the bathtub and the shower curtain is on my right.", ["Are there any towels for when I get out of the bath?", "How many towels are there for me to choose from?", "Where is the mirror to see how my hair looks after the shower?", "Where is the plunger?", "If I need to unclog the toilet, is there a plunger available?"]], "situation_3": ["I am leaning on the door facing the sink.", ["What will I walk into first if I go right?", "If I use the toilet to my left will there be any toilet paper within reach?", "What can I grab that is to my left to stop the toilet from overflowing?", "Will I get slammed if someone tried to walk in through the doorway behind me?", "What do I need to close to keep the water inside the shower to my left?"]], "situation_4": ["I am leaning on the wall facing the bathtub with the door on my left within reach.", ["How many bathtubs are in front?", "How many shower curtains are in front?", "How many bathroom cabinets are on the right?", "How many toilets are on the right?", "How many sinkare on the right?"]], "situation_5": ["I am getting the towel on the wall with the toilet behind me.", ["What is hanging from the door in front of me?", "Is the toilet seat closed or open behind me?", "If I wanted to use the bathtub , where should I walk to?", "What side is the door handle on the door in front of me?", "What shape is the sink to my left behind me?"]], "situation_6": ["I am opening the door.", ["I forgot to dry my hands, what is something within reach that I can use?", "If I swing the door in front of me quickly, what might fall off the back of it?", "I want to make sure my face is clean, what direction should I turn?", "Did I forget to put the lid down on the toilet behind me?", "Can I check myself out in a mirror before I leave without turning around?"]], "situation_7": ["I am sitting on the toilet facing the towel on the wall.", ["What color is the towel?", "How many towels are on the wall and door in front of me?", "Am I facing the door?", "What direction should I move if I want to use the sink?", "What water fixture is on my right?"]], "situation_8": ["I am washing my face at the sink.", ["What item is hanging on something directly behind me?", "What is the first item to my left that is in a corner?", "What is the first item to my left not counting the bathroom cabinet?", "What color is the toilet to my left?", "What is the biggest item behind me?"]], "situation_9": ["I am standing in the bathtub with the shower curtain to my immediate left.", ["What can I use that is to the left of me on a rack to dry myself?", "What is to the left of me that prevents water from splashing into the floor?", "What shape is the bathtub I am standing on?", "Is the toilet seat covered up or down?", "What is hung on the door to my left side?"]]}, "scene0040_00": {"situation_0": ["I am writing on the whiteboard with a couch to my left.", ["What side is the door handle on the door in front of me to the left?", "What color is the couch behind me?", "What direction should I go to go to the closest bookshelf?", "How many monitors are behind me on the desk?", "What is the bookshelf to my left made off?"]], "situation_1": ["I am sitting on the chair working at the desk with a trash can on my right and a whiteboard on my left.", ["Is the monitor in front of me horizontal or vertical?", "I need a drink where is my cup?", "Which objects can I write on?", "Is there a trash can under my desk?", "Which direction do I need to go to leave the room?"]], "situation_2": ["I am sitting on the couch facing a desk with a pillow to my left within reach.", ["How many teddy bears are there on a desk on my left?", "Is the bookshelf on my right wider than the bookshelf on my left?", "Could I touch an office chair without standing up?", "Is the stuffed animal on a desk behind me similar to snow or grass by color?", "Which object on my left do I need for typing?"]], "situation_3": ["I am sitting on the chair typing on the keyboard with a cardboard on my right.", ["Is the door to my left closed or open that is behind me?", "What direction should I go if I wanted to leave the room?", "How many drawers does the dresser have to my right side?", "What is in front of me to my right that I use a marker to write with?", "What is the round object in front of me that could tell me the time of the day?"]], "situation_4": ["I am wiping things off the whiteboard with a cabinet to my immediate right.", ["What color is the couch behind me to the left side?", "What are the objects posted on the wall to my left, above the monitor?", "How many pillows on the orange couch to my left, behind me are leaning on the armrest?", "How many drawers does the cabinet have on my right?", "What direction should I go to get a book from the bookshefl?"]], "situation_5": ["I am fixing the bookshelf and on my right there is a monitor on the desk.", ["What is the monitor on my right sitting on?", "How many rows of bookshelves are to my right?", "What color is the couch behind me to the right?", "Is the monitor on my right on or off?"]], "situation_6": ["I am choosing books from the bookshelf with the door to my immediate right.", ["What color is the couch behind me?", "What color is the cabinet behind me to the left?", "What color is the bottle on the desk?", "What color is the bookshelf in front of me?", "How many brown couches are there behind me?"]], "situation_7": ["I am exiting the room.", ["Do I need to open the door in front of me to exit or can I just walk out?", "What side is the doorknob on the door in front of me?", "What color is the couch behind me?", "What color is the pillow on the couch behind me?"]], "situation_8": ["I am writing on the whiteboard on the same wall with the door.", ["Are there any desks in the room?", "How many whiteboards are in the room?", "Where are the desks at?", "What is below me and the whiteboard I am at?", "Are there other whiteboards?"]], "situation_9": ["I am sitting on the office chair facing the monitor with a bookshelf in my 2 o'clock direction.", ["The couch behind me is the same color as what fruit that is round?", "What if I wanted to look out the window, where do I go?", "What color is the trash can to my right?", "Is the door closed to my right?", "Is there a pillow that is red on the couch behind me?"]]}, "scene0051_00": {"situation_0": ["I am sitting on my chair using the laptop.", ["What color is the pillow cover on the bed to my left?", "What is portable that is in front of me and often placed on a lap?", "If I wanted to put away a book, what direction should I go?", "If I wanted to do laundry, what should I pick up behind me on the floor?", "What size is the bed to my left side?"]], "situation_1": ["I am looking for a book to read.", ["What side of the desk should I approach if I want to turn my computer on, right or left?", "What object is on the floor next to the exit door?", "How many different types of computers are on my right?", "How many pillows are on the bed to my left?", "If it is too hot in the room, where can I find a fan to cool down?"]], "situation_2": ["I am taking a shower with the sink in my twelve o'clock direction.", ["Where should I go to put my dirty clothes in after showering?", "Which is closer to the bed on my left, a bookshelf or a dresser?", "Which has the same color as the bed on my left, a pillow or a blanket?", "Which is closer to the bed on my left, a fan or a nightstand?", "Where should I go to surf the internet?"]], "situation_3": ["I am facing the dresser with a table behind me.", ["Is the laundry basket behind me close enough to put in clothes without having to throw them?", "Which is bigger in size between the bed and the bookshelf to my left?", "How many pillows are on the bed to my left?", "Which direction should I go to access the exit?", "Is the bed to my left the same color as the sky?"]], "situation_4": ["I am trying to get inside the closet with a chair on my left.", ["What computer on the desk to my left is portable?", "How many computers are on the desk to my left?", "What color is the blanket on the bed behind me?", "Is the toilet seat covered down or up in the bathroom to my right?", "Which computer screen is bigger the laptop or desktop monitior?"]], "situation_5": ["I am sitting on one side of my bed and there is a nightstand on my right side within reach.", ["What is the object to my right in front of me that blows cold air?", "How many pillows behind me that are pink?", "How many laptops are on the table to my left?", "Is the toilet set cover open or closed in the bathroom to my right?", "What color is the blanket behind me?"]], "situation_6": ["I am sitting on a chair while watching a video on the monitor in front of me.", ["Where do I have to reach if I want to turn my computer's power off?", "What object on the desk to my left is portable and can sit on the lap?", "Is the toilet cover down or up in the bathroom behind me?", "Are the blinds on the windows on my left down or up?", "If I wanted to get a book to read, where would I go in the room to my right to find one?"]], "situation_7": ["I am sitting on the chair closer to the computer tower and facing the table.", ["How many shelfs are on the left?", "How many tables are in front of me?", "How many beds are behind me?", "How many monitors are on the table?", "How many laptops are on the table?"]], "situation_8": ["I am standing by the bookshelf facing the bed.", ["What is above the dresser that is on my 5 o'clock?", "Is the amount of pillows on top of the bed odd or even?", "What is under the laptop that is on my 7 o'clock?", "What is above the blanket at my 2 o'clock?", "How many fans are in the room?"]], "situation_9": ["I am standing by the nightstand on my left and facing the bed.", ["Is the toilet seat covered up or down in the bathroom to my left?", "What is to my right side by wall in front of me I can find books in?", "Where should I put my dirty clothes behind me?", "What is providing a light source to the room naturally on my right?", "What type of computer is on the desk to my right that is portable?"]]}}