{"220602000032": {"situation": "I am looking out the window while standing between two tables and the radiator is within reach.", "alter_situation": ["I want to open the window on the left side of the picture to allow more air into the room.", "I had to close the window because I was cold, and the couch was to my right."], "scene": "scene0024_00", "number": "0"}, "220602000103": {"situation": "I am sitting on a chair under the whiteboard and facing the desk with another chair on my left.", "alter_situation": ["I am standing in front of the chair behind me, trash bins to the right of the chair and trying to work on my desk in front of me.", "I am working at a computer tower on the table."], "scene": "scene0017_00", "number": "0"}, "220602000198": {"situation": "I am opening a door with a trash can on my right.", "alter_situation": ["I am holding the door handle in front of me with my right hand to swing it open.", "I want to get out of the room through the door on the right side of the kitchen cabinet."], "scene": "scene0047_00", "number": "0"}, "220602000226": {"situation": "I am sitting on a couch facing the coffee table while there is a bicycle and a curtain on my left.", "alter_situation": ["I sit on the couch and place my coffee down on top of the coffee table in front of me.", "Sitting on a couch with my feet on a coffee table, I notice that one book on a shelf in front of me is missing."], "scene": "scene0000_00", "number": "0"}, "220602000230": {"situation": "I am sitting on the chair relaxing a little and next to my right side there is a chair and a whiteboard.", "alter_situation": ["I want to arrange staff on the desk to my left side.", "I am sitting on a chair with my forearms on the desk as I read a book facing the door in front of me."], "scene": "scene0017_00", "number": "1"}, "220602000231": {"situation": "I am washing my hands at the sink with another sink on my left.", "alter_situation": ["I wash my hands in the sink and to my right is the bathtub.", "I am standing on the right side of the vanity."], "scene": "scene0034_00", "number": "0"}, "220602000318": {"situation": "I am sitting on the toilet, doing my business. I can see some boxes in front of me.", "alter_situation": ["I flushed the toilet and the sink was to my right.", "I am doing my business on the toilet as I stare at the window in front of me."], "scene": "scene0054_00", "number": "0"}, "220602000330": {"situation": "I am sitting on the leftmost side of a couch in front of a ball, while there are two lamps on my left.", "alter_situation": ["I just got up from the couch and I am looking toward the piano.", "I sat on the couch and knit a sweater and the piano was in front of me."], "scene": "scene0024_00", "number": "1"}, "220602000418": {"situation": "I am doing my dishes at the sink.", "alter_situation": ["I am standing at the kitchen counter with the table behind me.", "I am washing my hands in a sink directly in front of me."], "scene": "scene0047_00", "number": "1"}, "220602000426": {"situation": "I am sitting on the chair facing the kitchen counter while there is a chair on my left.", "alter_situation": ["I am sitting in the chair on the right side of the table eating and facing the kitchen counter.", "I am sitting in a chair facing a dining table and another chair to my left and a counter behind me at 7 o'clock."], "scene": "scene0047_00", "number": "2"}, "220602000457": {"situation": "I am sitting in the bathtub with the toilet on my left.", "alter_situation": ["I've just had a warm bath in the bathtub behind.", "I just got out of the bathtub. The toilet is to my left."], "scene": "scene0065_00", "number": "0"}, "220602000485": {"situation": "I am standing by the toilet on my left facing the bathtub.", "alter_situation": ["I just came from the toilet and now I am walking toward the bathtub.", "Walking towards the bathtub in front of me to take a bath."], "scene": "scene0034_00", "number": "1"}, "220602000556": {"situation": "I am shaving at the sink.", "alter_situation": ["I washed my hands in the sink and to my right was the toilet.", "I am washing my face in front of the sink with warm water and soap."], "scene": "scene0054_00", "number": "1"}, "220602000585": {"situation": "I am facing a bathtub, while there is a toilet on my left.", "alter_situation": ["The bathtub in front of me is being filled with hot water, while I am arranging the towel that I would use afterwards on my left.", "I am hopping into the bathtub in bathroom to shower."], "scene": "scene0054_00", "number": "2"}, "220602000608": {"situation": "I am fixing the bathroom cabinet with the door behind me.", "alter_situation": ["I am washing my hands in the sink on the right side of the toilet.", "I am washing my hands in the sink in front of me."], "scene": "scene0065_00", "number": "1"}, "220602000707": {"situation": "I am writing on the whiteboard with a couch to my left.", "alter_situation": ["I am reading what is written on the whiteboard in front to my friend on the phone.", "I am writing five words on the whiteboard in front of me, a black chair is to my right."], "scene": "scene0040_00", "number": "0"}, "220602000958": {"situation": "I am standing in between a chair and the door and facing two trash cans.", "alter_situation": ["I am standing on the left side of chair, bottom left of room, trying to read what's on the whiteboard in front of me.", "I am standing on the left side of the table and looking at someone working on the whiteboard."], "scene": "scene0017_00", "number": "2"}, "220602001075": {"situation": "I am lying on my bed and there is a couch in front of me.", "alter_situation": ["I got out of bed and right in front of me is the couch.", "I was tired so I lay in bed and in front of me was the couch."], "scene": "scene0000_00", "number": "1"}, "220602001109": {"situation": "I am sitting on the couch facing the coffee table and the TV. There is a guitar case to my immediate right.", "alter_situation": ["I placed my coffee down on the coffee table and to my left is the couch.", "I placed my phone down on the coffee table and behind me was the couch."], "scene": "scene0000_00", "number": "2"}, "220602001161": {"situation": "I am opening a door.", "alter_situation": ["I walked out of the door and the cabinet was to my right.", "I just threw a piece of paper into the trash can on my left, pushing the door with one hand in front of me to open it."], "scene": "scene0000_00", "number": "3"}, "220602001269": {"situation": "I am standing by the microwave on my left with a refrigerator in my three o'clock direction.", "alter_situation": ["I have just placed some food in the microwave on my left to heat.", "I just inserted my left over dinner into the microwave on the counter to my left."], "scene": "scene0047_00", "number": "3"}, "220602001351": {"situation": "I am opening the closet door with another closet door on my right.", "alter_situation": ["I need to find my shoes in the closet so I open the closet door and to my left is the desk.", "I walked through the door and a bookshelf was to my left."], "scene": "scene0054_00", "number": "3"}, "220602001421": {"situation": "I am sitting on a piano bench facing the couch with the armchair in my one o'clock direction.", "alter_situation": ["I have been playing the piano behind, I want now to rest on the couch below the picture.", "I walked towards the couch in front of me to relax and to my right was an arm chair."], "scene": "scene0024_00", "number": "2"}, "220602001424": {"situation": "I am opening the window with a desk on my left.", "alter_situation": ["I am wiping off dust on the window behind the table.", "I am looking out the window in the top right corner of the room waiting for the chinese food delivery person to arrive at my door."], "scene": "scene0017_00", "number": "3"}, "220602001751": {"situation": "I am standing inside the bathtub and the shower curtain is on my right.", "alter_situation": ["I am taking a bath in the bathtub on the left side of the door.", "I am sitting in the bathtub. The toilet is to the right and ahead of me."], "scene": "scene0065_00", "number": "2"}, "220602001762": {"situation": "I am sitting on a chair facing a chair with another chair on my right.", "alter_situation": ["I am having my lunch on the table in front of the kitchen cabinet.", "I am sitting on the chair on the left side of the table while I stare at the faucet running on the sink in front of me."], "scene": "scene0047_00", "number": "4"}, "220602001884": {"situation": "I am standing by the toilet with a door on my left.", "alter_situation": ["I exit the doorway and there are sinks to my right.", "I am walking through the door and toward the window."], "scene": "scene0034_00", "number": "2"}, "220602001886": {"situation": "I am crouched in front of the box keeping some documents and in front of me is the door.", "alter_situation": ["I am unpacking the box on the left side of the door.", "I put down the box in front of me before I leave through the door in front of me to the right."], "scene": "scene0024_00", "number": "3"}, "220602002212": {"situation": "I am leaning on the door facing the sink.", "alter_situation": ["I want to get soap from the bathroom cabinet on the right side of the toilet.", "I am standing in front of the cabinet and washing my hands in the sink."], "scene": "scene0065_00", "number": "3"}, "220602002327": {"situation": "I am throwing trash into a trash can while the whiteboard is on my right within reach.", "alter_situation": ["I want to empty the trash cans in front of the wall on the right side of the door.", "I am standing near the two trash bins as I ponder what I should do next."], "scene": "scene0017_00", "number": "4"}, "220602002374": {"situation": "I am lifting up the bicycle while there is a cabinet on my right and a couch behind me.", "alter_situation": ["I walk over to the left of the couch to grab my bicycle.", "I am about to look for another place for the bicycle in front of me, maybe put it near the table in my ten o'clock direction or near the cabinet in my eight o'clock direction."], "scene": "scene0000_00", "number": "4"}, "220602002430": {"situation": "I am washing my face with a door in my six o'clock direction.", "alter_situation": ["I wash my hands in the sink at the bathroom vanity and there is another sink to my right.", "I am standing on the left side of the vanity. The bathtub is to my right."], "scene": "scene0034_00", "number": "3"}, "220602002534": {"situation": "I am pulling a table that has a curtain behind it while there is a desk on my left.", "alter_situation": ["I place my laptop on top of the table which is in front of the curtain.", "Just got out from the bed behind me and went to a table in front of me to pick up a bill and throw it in a trash can in my eight o'clock direction."], "scene": "scene0000_00", "number": "5"}, "220602002545": {"situation": "I am picking up my bag on the ground with the dolly to my right.", "alter_situation": ["I look for the disk drives on the shelves and there are shelves on both sides of me.", "I placed my bag on the floor and the door was to my left."], "scene": "scene0054_00", "number": "4"}, "220602002550": {"situation": "I am pushing a door and there is a trash can by my left foot.", "alter_situation": ["I have just thrown some trash paper into the trash can on my left.", "I am facing the door in front of me as I throw a piece of wrapper on the trash can with my left hand to my left."], "scene": "scene0047_00", "number": "5"}, "220602002686": {"situation": "I am sitting on my chair using the laptop.", "alter_situation": ["Just finished with the laundry basket in my seven o'clock direction, I am playing a videogame, reading the chat on a monitor in my two o'clock direction.", "I sat at the table to get work done on the computer and was in the chair behind me."], "scene": "scene0051_00", "number": "0"}, "220602002859": {"situation": "I am looking for a book to read.", "alter_situation": ["I am looking for something to read on the bookshelf before I go and lay in bed.", "I am trying to find a book on the bookshelf so I have something to read when I am laying on the bed to my left side."], "scene": "scene0051_00", "number": "1"}, "220602002872": {"situation": "I am closing a microwave.", "alter_situation": ["I toasted some bread in the toaster oven and above me was the microwave.", "I am placing my bread into the toaster oven in front of me on the counter."], "scene": "scene0000_00", "number": "6"}, "220602002882": {"situation": "I am sitting on the chair working at the desk with a trash can on my right and a whiteboard on my left.", "alter_situation": ["I am having a drink using a bottle on the desk behind the couch.", "I am sitting on my chair facing the desk, reaching with my left hand to turn on my computer monitor on the left side of the desk."], "scene": "scene0040_00", "number": "1"}, "220602002936": {"situation": "I am serving dishes to the dining table with the refrigerator in my one o'clock direction and a door opening behind me.", "alter_situation": ["I am looking over the end of a dining table. There is a trash can behind me and to the right.", "I am facing at the head of a dining table with a trash can behind me at 5 o'clock."], "scene": "scene0047_00", "number": "6"}, "220602002948": {"situation": "I am taking a shower with the sink in my twelve o'clock direction.", "alter_situation": ["Taking a shower, I am trying to reach for a toobrush near the sink in front of me.", "I was in the shower cleaning up and the toilet was to my left."], "scene": "scene0051_00", "number": "2"}, "220602003001": {"situation": "I am sitting on the couch facing a desk with a pillow to my left within reach.", "alter_situation": ["I am resting on the couch on the right side of the table after having a long day.", "I am sitting on top of the pillow on the couch as I talk on my cellphone."], "scene": "scene0040_00", "number": "2"}, "220602003007": {"situation": "I am facing the dresser with a table behind me.", "alter_situation": ["I grab some clothes from the dresser that is to the right of my bed.", "I went over to the dresser to grab a t shirt and the bookcase was to my left."], "scene": "scene0051_00", "number": "3"}, "220602003077": {"situation": "I am closing a refrigerator.", "alter_situation": ["I opened up the refrigerator and to my right was the door.", "I am reaching inside the refrigerator to grab ice from the freezer portion of the fridge."], "scene": "scene0000_00", "number": "7"}, "220602003613": {"situation": "I am sitting on the chair typing on the keyboard with a cardboard on my right.", "alter_situation": ["I am watching a movie on the monitor immediately on the left side of the tube.", "I am surfing the internet sitting on the chair and desk and looking at the large monitor in front of me."], "scene": "scene0040_00", "number": "3"}, "220602003814": {"situation": "I am printing files.", "alter_situation": ["I walk over to the window to get a look and behind me is the couch.", "I worked at my desk and decided to open up the window in front of me."], "scene": "scene0054_00", "number": "5"}, "220602003822": {"situation": "I am wiping things off the whiteboard with a cabinet to my immediate right.", "alter_situation": ["I want to pin a paper on the whiteboard behind the tube.", "The desk is to my left and I am writing the notes on the whiteboard in front of me with difficulty."], "scene": "scene0040_00", "number": "4"}, "220602003876": {"situation": "I am standing on a mug facing a door while there is a sink behind me.", "alter_situation": ["The mat under me is kind of dusty and the door in front of me has stains on it.", "I had just finished washing my hands behind me on sink, leaving the bathroom via door in front of me."], "scene": "scene0054_00", "number": "6"}, "220602003891": {"situation": "I am fixing a radiator facing a window on top of it.", "alter_situation": ["I am looking out the window and there is a table on my right.", "I looked out of the window and to my right was the couch."], "scene": "scene0024_00", "number": "4"}, "220602003959": {"situation": "I am sitting in the bathtub and facing the window.", "alter_situation": ["I am done with the bathtub behind me and I am on my way to walk out of the door in front of me.", "I am walking away from the bathtub and toward the door."], "scene": "scene0034_00", "number": "4"}, "220602004015": {"situation": "I am fixing the bookshelf and on my right there is a monitor on the desk.", "alter_situation": ["I am organizing the bookshelf in front of me before I sit down on the orange couch to nap behind me to my right side.", "I placed my folder on top of the bookcase and to my right was my desk."], "scene": "scene0040_00", "number": "5"}, "220602004022": {"situation": "I am trying to get inside the closet with a chair on my left.", "alter_situation": ["After my shower , I pick a good outfit from the closet in front of me. I'll sit down on the chair at my left to put my shoes too.", "I am inside the closet facing the clothes trying to find my black suit, the bed is behind me to the right."], "scene": "scene0051_00", "number": "4"}, "220602004029": {"situation": "I am leaning on the wall facing the bathtub with the door on my left within reach.", "alter_situation": ["I want to get out of the room through the door on my left.", "I am walking to the bathtub. The sink is to my right."], "scene": "scene0065_00", "number": "4"}, "220602004055": {"situation": "I am getting the towel on the wall with the toilet behind me.", "alter_situation": ["I want to wipe my hands using the towel in front of the toilet.", "I am drying my hands on the towel in front of the toilet."], "scene": "scene0065_00", "number": "5"}, "220602004111": {"situation": "I am washing my hands on the kitchen counter.", "alter_situation": ["I am washing both my hands with dish soap on the soap in front of me, the fridge is on my left.", "I washing some plates in the sink on the left side of the refrigerator."], "scene": "scene0047_00", "number": "7"}, "220602004157": {"situation": "I am getting a book from the bookshelf, while having a ball on my right.", "alter_situation": ["I am placing my keys on top of the bookshelf in front of me so I do not lose them again. I am going to take a nap on the couch that is on my 4 o'clock.", "I found a book on the bookshelf in front of me."], "scene": "scene0054_00", "number": "7"}, "220602004194": {"situation": "I am choosing books from the bookshelf with the door to my immediate right.", "alter_situation": ["I am searching for a book on the bookshelf in front of me to read on my desk on my left side.", "I tried looking for my favorite book on the bookshelf and behind me was a couch."], "scene": "scene0040_00", "number": "6"}, "220602004267": {"situation": "I am exiting the room.", "alter_situation": ["I am pulling the door handle with my right hand , the door handle is to the right in front of me to exit the room.", "I walked over to the door to open it and to my right were two whiteboards."], "scene": "scene0040_00", "number": "7"}, "220602004275": {"situation": "I am sitting on the carseat facing a door.", "alter_situation": ["I am resting on the carseat that is on the floor, while having one foot on top of the bad that is on my right.", "I just left the car seat behind me and the ladder is to my left side on the wall."], "scene": "scene0054_00", "number": "8"}, "220602004518": {"situation": "I am sitting on the ground resting my back against the bathroom vanity and facing towels on the door.", "alter_situation": ["I am done washing my hands in the sink behind me and I walk towards the door in front of me.", "I am walking from the vanity toward the door."], "scene": "scene0034_00", "number": "5"}, "220602004633": {"situation": "I am sitting on the toilet and there is a window to the right.", "alter_situation": ["I am at the door, looking at the shower.", "I am opening the shower door because I want to take a shower."], "scene": "scene0034_00", "number": "6"}, "220602004682": {"situation": "I am writing on the whiteboard on the same wall with the door.", "alter_situation": ["I am writing a reminder on the whiteboard on the right side of the door.", "I am writing some notes on the whiteboard on my right side."], "scene": "scene0040_00", "number": "8"}, "220602004705": {"situation": "I am sitting on the chair at my desk watching videos on my monitor.", "alter_situation": ["I turned on the monitor that was sitting on top of my desk.", "I am browsing the internet on my monitor while sitting on my chair and desk in top right corner of the room."], "scene": "scene0054_00", "number": "9"}, "220602004814": {"situation": "I am sitting on the office chair facing the monitor with a bookshelf in my 2 o'clock direction.", "alter_situation": ["I am have some coffee using the cup on the desk between the bookshelves.", "I am standing and typing on the keyboard as I watch words on the monitor pop in front of me."], "scene": "scene0040_00", "number": "9"}, "220602004938": {"situation": "I am packing my bag that is on the table with a chair on my right.", "alter_situation": ["I want to pick the bag on the table in front of the cabinet.", "I am standing behind the chair on the left side of the dinner with both my hands resting on the back rest as I stare at the food on the table in front of me."], "scene": "scene0024_00", "number": "5"}, "220602004967": {"situation": "I am opening the door.", "alter_situation": ["I am about to close the door in front of the bathroom cabinet.", "I am grabbing the towel off the back of the door."], "scene": "scene0065_00", "number": "6"}, "220602005070": {"situation": "I am leaning on the radiator facing a table with six chairs.", "alter_situation": ["I am facing the table. There is a window behind me and a cabinet ahead me and to the right.", "I looked out of the window behind me to see what the commotion was and to my left was the couch."], "scene": "scene0024_00", "number": "6"}, "220602005149": {"situation": "I am sitting on one side of my bed and there is a nightstand on my right side within reach.", "alter_situation": ["I am sitting on the edge of the bed taking a break reading something in my phone after I turned off the fan that is on my right.", "I just got up out of bed, trying to turn on my lamp on my right side on top of the nightstand with my right arm."], "scene": "scene0051_00", "number": "5"}, "220602005302": {"situation": "I am serving dishes to the dining table with the refrigerator in my nine o'clock direction.", "alter_situation": ["I am having dinner while sitting on chair and table in front of me, the fridge is to my left", "I am cleaning the dining table in front of the kitchen cabinet."], "scene": "scene0047_00", "number": "8"}, "220602005443": {"situation": "I am throwing trash while there is a door on my left.", "alter_situation": ["I am facing the door and the kitchen counter is to my left.", "I am facing a trash can directly in front of me."], "scene": "scene0047_00", "number": "9"}, "220602005582": {"situation": "I am sitting on a chair while watching a video on the monitor in front of me.", "alter_situation": ["I am working on a project sitting on my chair in front of a table using the computer tower that is on my right and the laptop on my left.", "I am online shopping on my computer on the desk while sitting on the chair."], "scene": "scene0051_00", "number": "6"}, "220602005824": {"situation": "I am cleaning the window with the desk on my right.", "alter_situation": ["I am making a call in front of the window.", "I am standing in the top right corner of the room looking out the window in front of me for people outside."], "scene": "scene0017_00", "number": "5"}, "220602006103": {"situation": "I am sitting on the chair closer to the computer tower and facing the table.", "alter_situation": ["I take a seat at the chair at the table so I can work at my monitor in front of me.", "I went over to the table to turn on the monitor."], "scene": "scene0051_00", "number": "7"}, "220602006112": {"situation": "I am opening a door.", "alter_situation": ["I want to open the door in front of the box to allow my friends in.", "I opened up the door so I could get outside and the piano was to my left."], "scene": "scene0024_00", "number": "7"}, "220602006458": {"situation": "I am playing with the ball and on my left is the couch within reach.", "alter_situation": ["I am about to place a cup of tea on the table on the left side of the armchair.", "I am reaching for the lamp switch with my left hand to turn it off as I quickly glance out the window in front of me."], "scene": "scene0024_00", "number": "8"}, "220602006541": {"situation": "I am sitting on the toilet facing the towel on the wall.", "alter_situation": ["I've just flushed the toilet on the right side of the bathroom cabinet.", "I am sitting on the toilet looking at the wall in front of me."], "scene": "scene0065_00", "number": "7"}, "220602006845": {"situation": "I am standing by the bookshelf facing the bed.", "alter_situation": ["I am collecting dirty sheets from a bed in front me and tossing them to a laundry basket in my ten o'clock direction.", "I climbed into bed and to my left was the laundry basket."], "scene": "scene0051_00", "number": "8"}, "220602007092": {"situation": "I am standing by the nightstand on my left and facing the bed.", "alter_situation": ["Just switched on the fan in my eight o'clock direction and reaching for the pillow in my one o'clock direction now, while there is a nightstand on my left.", "I climbed into bed to get some rest and to my right was the bookshelf."], "scene": "scene0051_00", "number": "9"}, "220602007125": {"situation": "I am sitting on a chair facing the whiteboard with a door in my nine o'clock direction.", "alter_situation": ["I am sitting on my chair, bottom left side of the room, taking notes on what's written on the whiteboard.", "I am sitting in a chair by myself and looking at the whiteboard."], "scene": "scene0017_00", "number": "6"}, "220602007374": {"situation": "I am pushing the door.", "alter_situation": ["I am facing the blue door, the light is hurting my eyes coming from the door opening to my right.", "I am opening the door. There is a chair to my left."], "scene": "scene0017_00", "number": "7"}, "220602007913": {"situation": "I am opening the refrigerator and there is a table behind me.", "alter_situation": ["I was hungry so I opened the fridge and to my right is the trash can.", "I wanted to grab a drink from the fridge and to my right was the trash can."], "scene": "scene0000_00", "number": "8"}, "220602007916": {"situation": "I am opening the curtain and there is a bicycle on my right.", "alter_situation": ["I walk over to open the curtains and to my right is a TV.", "I wanted some light into the room so I opened up the curtains and to my right was a TV."], "scene": "scene0000_00", "number": "9"}, "220602008352": {"situation": "I am throwing trash into the trash can with another trash can on my right and the door is right behind me.", "alter_situation": ["I am trying to write something on the whiteboard but the two trash cans in front of me are on the way.", "I am doing work on the left side of the white board."], "scene": "scene0017_00", "number": "8"}, "220602009114": {"situation": "I am washing my face at the sink.", "alter_situation": ["I am washing my face in the sink just below the mirror.", "I am washing my hands at the sink."], "scene": "scene0065_00", "number": "8"}, "220602009818": {"situation": "I play the piano.", "alter_situation": ["I am playing the piano on the left side of the box.", "I practiced the piano and the window was to my left."], "scene": "scene0024_00", "number": "9"}, "220602011797": {"situation": "I am taking the towel from the door.", "alter_situation": ["I am opening the door and I see there are robes hanging from it.", "I am grabbing the dark blue towel that is hanging from a hook attached to the door."], "scene": "scene0034_00", "number": "7"}, "220602013587": {"situation": "I am standing in the bathtub with the shower curtain to my immediate left.", "alter_situation": ["I am bathing in the bathtub on the far right side of the door.", "I am in the bathtub and the shower curtain is to the left of me."], "scene": "scene0065_00", "number": "9"}, "220602017598": {"situation": "I am cleaning the whiteboard and there are two trash cans on the left.", "alter_situation": ["I am doing some calculations on the whiteboard above the trash cans on my left.", "I am standing next the green chair on the left side as I write with my left hand on the whiteboard."], "scene": "scene0017_00", "number": "9"}, "220602019668": {"situation": "I am taking a shower facing the towels on the wall.", "alter_situation": ["I just walked from the shower and I saw a rack of towels in front of me.", "I am grabbing the blue towel because I just got out of the shower and I am wet."], "scene": "scene0034_00", "number": "8"}, "220602025795": {"situation": "I am fixing the scale next to the shelf to my left.", "alter_situation": ["I am grabbing a pink towel off of the shower rod on the wall.", "I am grabbing the light blue towel hanging from the lowest towel bar."], "scene": "scene0034_00", "number": "9"}, "220602001021": {"situation": "I am entering the room.", "alter_situation": ["I am standing in front of the bathroom door to my right.", "I walked down the hallway and to the right was the bathroom."], "scene": "scene0046_00", "number": "0"}, "220602001237": {"situation": "I am washing my face at the sink with a bathtub on my right.", "alter_situation": ["I have my head down on top of the sink in the bathroom because I am not feeling too well.", "I am washing my hands in the sink in the bathroom."], "scene": "scene0046_00", "number": "1"}, "220602002371": {"situation": "I am standing by the desk facing the wardrobe and a suitcase.", "alter_situation": ["I am looking at wardrobe closet trying to figure what to wear.", "I dropped my suitcase on the floor and to my right was a chair."], "scene": "scene0046_00", "number": "2"}, "220602002454": {"situation": "I am using the toilet.", "alter_situation": ["I am sitting on the toilet and using my right hand to partially close the door in front of me.", "I am standing on the mat in the bathroom. The toilet is behind me."], "scene": "scene0046_00", "number": "3"}, "220602002509": {"situation": "I am standing by the toilet facing the bathtub.", "alter_situation": ["I am standing outside and facing bathtub to use to wash my body.", "I entered the bathtub and to my left was a sink."], "scene": "scene0046_00", "number": "4"}, "220602003278": {"situation": "I am standing picking up my pillow with a backpack in my six o'clock direction.", "alter_situation": ["I am facing the bed and arranging the bedsheets in front of me.", "I fell asleep on the bed and the light was to my left."], "scene": "scene0046_00", "number": "5"}, "220602003590": {"situation": "I am lying on the bed with a table in my nine o'clock direction and facing the wardrobe.", "alter_situation": ["I am laying on the bed, relaxing and watching an episode of my favorite show on the TV in front of me.", "I am lying on the bed and looking at the curtains."], "scene": "scene0046_00", "number": "6"}, "220602004520": {"situation": "I am packing my suitcase with the wardrobe behind me.", "alter_situation": ["I grabbed clothes from the cabinet behind me and packed my suitcase with clothing in front of me.", "I just turned away from the wardrobe. The bed is behind me as well."], "scene": "scene0046_00", "number": "7"}, "220602006422": {"situation": "I am sitting on the chair working on the laptop.", "alter_situation": ["I am sitting on the chair with desk, surfing the internet using my laptop on the desk.", "I am working on the laptop. The bed is behind me."], "scene": "scene0046_00", "number": "8"}, "220602007488": {"situation": "I am picking up my backpack with a table in front of me.", "alter_situation": ["I place my phone down on the table, and to my right is a door.", "I am at the end of a hall looking at a table."], "scene": "scene0046_00", "number": "9"}}